In [126]:
import pandas as pd
import numpy as np

In [127]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [128]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                  columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [129]:
# If apply a NumPy ufunc on either of these objects, 
# the result is another Pandas object with the indices preserved.
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [130]:
# Or, for a slightly more complex calculation
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [131]:
# Example: suppose we are combining two different data sources, 
#  and find only the top three US states by area 
#  and the top three US states by population:

In [132]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')
area

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

In [133]:
# Let's see what happens when we divide these 
#  to compute the population density:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [134]:
# The resulting array contains the union of
#   indices of the two input arrays
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [135]:
# missing number
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [136]:
A.add(B, fill_value=2)

0    4.0
1    5.0
2    9.0
3    7.0
dtype: float64

In [137]:
# Index alignment in DataFrame
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

   A   B
0  1  11
1  5   1

In [138]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('CBA'))
B

   C  B  A
0  4  0  9
1  5  8  0
2  9  2  6

In [139]:
A + B

      A     B   C
0  10.0  11.0 NaN
1   5.0   9.0 NaN
2   NaN   NaN NaN

In [140]:
# Here, fill with the mean of all values in A
#  (computed by first stacking the rows of A):
fill = A.stack().mean()
A.add(B, fill_value=fill)

      A     B     C
0  10.0  11.0   8.5
1   5.0   9.0   9.5
2  10.5   6.5  13.5

In [141]:
fill

4.5

In [142]:
#
A = rng.randint(10, size=(3, 4))
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [143]:
A[0]

array([3, 8, 2, 4])

In [144]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [145]:
df = pd.DataFrame(A, columns=list('QRST'))
df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -1 -2  2  4
2  3 -7  1  4

In [146]:
df.iloc[0]

Q    3
R    8
S    2
T    4
Name: 0, dtype: int64

In [147]:
# column-wise
df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [148]:
# automatically align
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int64

In [149]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN

In [150]:
# Missing Data
import numpy as np
import pandas as pd
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [151]:
# dtype = object
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
62.5 ms ± 4.45 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype = int
917 µs ± 9.99 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [152]:
# error
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [153]:
# NaN
vals2 = np.array([1, np.nan, 3, 4]) 
vals2

array([ 1., nan,  3.,  4.])

In [154]:
# like a data virus
1 + np.nan

nan

In [155]:
0 * np.nan

nan

In [156]:
# no errors, but not always useful
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [157]:
# NaN and None
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [158]:
x = pd.Series(range(4), dtype=int)
x

0    0
1    1
2    2
3    3
dtype: int64

In [159]:
x[0] = None
x

0    NaN
1    1.0
2    2.0
3    3.0
dtype: float64

In [160]:
# detecting null values
data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [161]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [162]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [163]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [164]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [165]:
# remove NA
data.dropna()

0        1
2    hello
dtype: object

In [166]:
data.fillna()

ValueError: Must specify a fill 'value' or 'method'.

In [167]:
#
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [168]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [169]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [170]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [171]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [172]:
df.dropna(how='any')

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [117]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [118]:
# filling null values
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [173]:
data.fillna(6)

0        1
1        6
2    hello
3        6
dtype: object

In [174]:
# forward-fill
data.fillna(method='ffill')

0        1
1        1
2    hello
3    hello
dtype: object

In [175]:
# back-fill
data.fillna(method='bfill')

0        1
1    hello
2    hello
3     None
dtype: object

In [176]:
# DataFrame
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [177]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

In [178]:
df1=df.fillna(method='ffill', axis=1)

In [179]:
df1.fillna(method='bfill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  4.0  6.0  6.0